Revit 2027 API
AlignmentStationLabel.Create Method
 Creates an AlignmentStationLabel object along with its underlying SpotDimension element. Returns null if element creation fails.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static AlignmentStationLabel Create(
	Alignment alignment,
	View view,
	AlignmentStationLabelOptions options
)
Public Shared Function Create (
	alignment As Alignment,
	view As View,
	options As AlignmentStationLabelOptions
) As AlignmentStationLabel
public:
static AlignmentStationLabel^ Create(
	Alignment^ alignment,
	View^ view,
	AlignmentStationLabelOptions^ options
)
static member Create :
        alignment : Alignment *
        view : View *
        options : AlignmentStationLabelOptions -> AlignmentStationLabel
Parameters
alignment Alignment
The alignment on which the alignment station label is placed.
view View
The view for which the alignment station label is created.
options AlignmentStationLabelOptions
The alignment station options of the label to be created.
Return Value
AlignmentStationLabel
See Also
Reference
AlignmentStationLabel Class
Autodesk.Revit.DB.Infrastructure Namespace